app/controllers/cars_controller.rb

  def index
    @cars = Car.all.order("created_at DESC")
---
SELECT "cars".* FROM "cars" ORDER BY created_at DESC

  def show
    @car = Car.find(params[:id])
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @car = Car.new(car_params)
    if @car.save
---
INSERT INTO "cars" ("lh_model", "lh_year", "lh_usage", "lh_fuel", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["lh_model", "Test"], ["lh_year", 1000], ["lh_usage", 20.3], ["lh_fuel", 12.6], ["created_at", "2021-01-19 20:43:22.184307"], ["updated_at", "2021-01-19 20:43:22.184307"]]

  def edit
    @car = Car.find(params[:id])
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @car = Car.find(params[:id])
    if @car.update(car_params)
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "cars" SET "lh_fuel" = ?, "lh_year" = ?, "lh_model" = ?, "lh_usage" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["lh_fuel", 1.1111111111], ["lh_year", 1], ["lh_model", "1"], ["lh_usage", 1.11111], ["updated_at", "2021-01-20 20:41:49.725307"], ["id", 1]]